{
  "healthCheckIntervalSeconds": 30,
  "enableUserConfig": false,
  "selectedTheme": "emerald",
  "menuItems": [
    {
      "text": "Home",
      "materialSymbol": "home_app_logo",
      "routerPath": "home",
      "divider": true
    },
    {
      "text": "Catalog",
      "materialSymbol": "book_ribbon",
      "routerPath": "catalog",
      "viewDescription": "In the catalog view you can browse datasets of other connectors. For each dataset you can run contract negotiations to consume the data afterwards. If the selected connector has a federated catalog, the available datasets of other participants will be displayed automatically. Otherwise, you can request the catalog of other connectors configured in the dashboard. At any time you can request the catalog of unknown connectors by requesting it manually."
    },
    {
      "text": "Assets",
      "materialSymbol": "deployed_code_update",
      "routerPath": "assets",
      "viewDescription": "The asset view allows you to create, edit and delete the assets (datasets) in your connector. An asset represents any data that can be shared, for example static files, streaming data or API access. The dashboard only allows you to create assets with data types that your data plane(s) support."
    },
    {
      "text": "Policy Definitions",
      "materialSymbol": "policy",
      "routerPath": "policies",
      "viewDescription": "The policy definitions view allows you to create, edit and delete policies. Policies are a generic way of defining a set of duties, rights, or obligations. EDC and DSP express policies with ODRL."
    },
    {
      "text": "Contract Definitions",
      "materialSymbol": "contract_edit",
      "routerPath": "contract-definitions",
      "viewDescription": "The contract definitions view allows you to create, edit and delete contract definitions. Contract definitions link assets and policies by declaring which policies apply to a set of assets. Contract definitions contain two types of policies: an access policy (who can see or discover the data contract offer) and a contract policy (the actual terms and conditions of data use once a contract has been agreed upon).",
      "divider": true
    },
    {
      "text": "Contracts",
      "materialSymbol": "handshake",
      "routerPath": "contracts",
      "viewDescription": "The contract view allows you to browse all contract negotiations that have been finished with an agreement. You can switch between providing and consuming contracts of the selected connector. For consuming contracts a transfer process can be started to receive the asset."
    },
    {
      "text": "Transfer History",
      "materialSymbol": "schedule_send",
      "routerPath": "transfer-history",
      "viewDescription": "The transfer history view lets you browse and deprovision finished and ongoing transfer processes. You can switch between providing and consuming transfer processes of the selected connector."
    }
  ]
}
